Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_spi_stm32l4.c
/*!
 * @file      smtc_hal_mcu_spi_stm32l4.c
 *
 * @brief      Implementation of SPI module on top of STM32L4 Low Level drivers
 *
 * The Clear BSD License
 * Copyright Semtech Corporation 2022. All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the disclaimer
 * below) provided that the following conditions are met:
 *     * Redistributions of source code must retain the above copyright
 *       notice, this list of conditions and the following disclaimer.
 *     * Redistributions in binary form must reproduce the above copyright
 *       notice, this list of conditions and the following disclaimer in the
 *       documentation and/or other materials provided with the distribution.
 *     * Neither the name of the Semtech corporation nor the
 *       names of its contributors may be used to endorse or promote products
 *       derived from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY
 * THIS LICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT
 * NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A
 * PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL SEMTECH CORPORATION BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 */

/*
 * -----------------------------------------------------------------------------
 * --- DEPENDENCIES ------------------------------------------------------------
 */

#include "stm32l4xx.h"
#include "stm32l4xx_ll_spi.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_dma.h"
#include "smtc_hal_mcu_spi.h"
#include "smtc_hal_mcu_spi_stm32l4.h"
#include <stddef.h>
#include <stdbool.h>

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE MACROS-----------------------------------------------------------
 */

/**
 * @brief Maximum number of SPI instances
 */
#ifndef SMTC_HAL_MCU_SPI_STM32L4_N_INSTANCES_MAX
#define SMTC_HAL_MCU_SPI_STM32L4_N_INSTANCES_MAX 4
#endif

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE CONSTANTS -------------------------------------------------------
 */

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE TYPES -----------------------------------------------------------
 */

typedef struct
{
    SPI_TypeDef* spi;
    DMA_TypeDef* dma;
    uint32_t     ahb_bus;
    uint32_t     dma_channel_irq_rx;
    uint32_t     dma_channel_irq_tx;
    uint32_t     dma_channel_rx;
    uint32_t     dma_channel_tx;
    uint32_t     periph_request;
} smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t;

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE VARIABLES -------------------------------------------------------
 */

/**
 * @brief Structure defining a SPI instance
 */
struct smtc_hal_mcu_spi_inst_s
{
    bool                                                 is_cfged;
    SPI_TypeDef*                                         spi;
    const smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t* dma_periph_mapping;
    void ( *DMAcallback_tx )( void );
    void ( *DMAcallback_rx )( void );
    void ( *DMAcallback_tx_error )( void );
    void ( *DMAcallback_rx_error )( void );
};

/**
 * @brief Array to store the SPI instances
 */
static struct smtc_hal_mcu_spi_inst_s spi_inst_array[SMTC_HAL_MCU_SPI_STM32L4_N_INSTANCES_MAX];

/**
 * @brief Static null value
 *
 * This null value has a static storage duration.
 * It ensures it always exists during DMA operation. It is used when DMA is used in a way that it has to send always the
 * same value.
 */
static const uint8_t dma_null_value = 0;

/**
 * @brief Static garbage value
 *
 * This value is used to provide a static storage that DMA uses when dumping value that should not be returned.
 */
static uint8_t garbage_value = 0;

/**
 * @brief Array of SPI/DMA peripheral configuration mapping
 */
static const smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t dma_periph_mappping[] = {
    {
        .spi                = SPI1,
        .dma                = DMA1,
        .ahb_bus            = LL_AHB1_GRP1_PERIPH_DMA1,
        .dma_channel_irq_rx = DMA1_Channel2_IRQn,
        .dma_channel_irq_tx = DMA1_Channel3_IRQn,
        .dma_channel_rx     = LL_DMA_CHANNEL_2,
        .dma_channel_tx     = LL_DMA_CHANNEL_3,
        .periph_request     = LL_DMA_REQUEST_1,
    },
    {
        .spi                = SPI2,
        .dma                = DMA1,
        .ahb_bus            = LL_AHB1_GRP1_PERIPH_DMA1,
        .dma_channel_irq_rx = DMA1_Channel4_IRQn,
        .dma_channel_irq_tx = DMA1_Channel5_IRQn,
        .dma_channel_rx     = LL_DMA_CHANNEL_4,
        .dma_channel_tx     = LL_DMA_CHANNEL_5,
        .periph_request     = LL_DMA_REQUEST_1,
    },
    {
        .spi                = SPI3,
        .dma                = DMA2,
        .ahb_bus            = LL_AHB1_GRP1_PERIPH_DMA2,
        .dma_channel_irq_rx = DMA2_Channel1_IRQn,
        .dma_channel_irq_tx = DMA2_Channel2_IRQn,
        .dma_channel_rx     = LL_DMA_CHANNEL_1,
        .dma_channel_tx     = LL_DMA_CHANNEL_2,
        .periph_request     = LL_DMA_REQUEST_3,
    }
};

/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DECLARATION -------------------------------------------
 */

/**
 * @brief Get DMA peripheric configuration from SPI peripheral
 */
static const smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t* smtc_hal_mcu_spi_stm32l4_get_dma_peripheral_configuration(
    SPI_TypeDef* spi );

/**
 * @brief Get a pointer to the first free slot
 *
 * @retval Pointer to the first free slot - NULL if there is no space left
 */
static struct smtc_hal_mcu_spi_inst_s* smtc_hal_mcu_spi_stm32l4_get_free_slot( void );

/**
 * @brief Check if the instance given as parameter is genuine
 *
 * @param [in] inst SPI instance
 *
 * @retval true Instance is genuine
 * @retval false Instance is not genuine
 */
static bool smtc_hal_mcu_spi_stm32l4_is_real_inst( smtc_hal_mcu_spi_inst_t inst );

/**
 * @brief Factorize IRQ calls for DMA channel IRQ
 *
 * @param dma The DMA peripheral that triggered the IRQ
 * @param channel The channel from DMA peripheral that triggered the IRQ
 */
static void smtc_hal_mcu_spi_stm32l4_call_dma_callback_irq( DMA_TypeDef* dma, uint32_t channel );

/**
 * @brief Factorize the call that determine if DMA's channel TC flag is set
 *
 * @param channel The channel to check
 * @param dma The DMA peripheral to check
 * @return uint32_t
 */
static uint32_t smtc_hal_mcu_spi_stm32l4_is_active_flag_tc( uint32_t channel, DMA_TypeDef* dma );

/**
 * @brief Factorize the clear of Global Interrupt DMA flag
 *
 * @param channel The channel to clear
 * @param dma The DMA peripheral to clear
 */
static void smtc_hal_mcu_spi_stm32l4_clear_flag_gi( uint32_t channel, DMA_TypeDef* dma );

/**
 * @brief Factorize the call that determine if DMA's channel TE flag is set
 *
 * @param channel The channel to check
 * @param dma The DMA peripheral to check
 * @return uint32_t
 */
static uint32_t smtc_hal_mcu_spi_stm32l4_is_active_flag_te( uint32_t channel, DMA_TypeDef* dma );

