Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_spi_stm32l4.c
/*
 * -----------------------------------------------------------------------------
 * --- PUBLIC FUNCTIONS DEFINITION ---------------------------------------------
 */

smtc_hal_mcu_status_t smtc_hal_mcu_spi_init( smtc_hal_mcu_spi_cfg_t cfg, const smtc_hal_mcu_spi_cfg_app_t* cfg_app,
                                             smtc_hal_mcu_spi_inst_t* inst )
{
    struct smtc_hal_mcu_spi_inst_s* spi_cfg_slot = smtc_hal_mcu_spi_stm32l4_get_free_slot( );

    if( spi_cfg_slot == NULL )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    spi_cfg_slot->spi = cfg->spi;

    if( spi_cfg_slot->spi == SPI1 )
    {
        /* Peripheral clock enable */
        LL_APB2_GRP1_EnableClock( LL_APB2_GRP1_PERIPH_SPI1 );
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOA );

        /** SPI1 GPIO Configuration
        PA5   ------> SPI1_SCK
        PA6   ------> SPI1_MISO
        PA7   ------> SPI1_MOSI
        */
        LL_GPIO_InitTypeDef GPIO_InitStruct = {
            .Pin        = LL_GPIO_PIN_5 | LL_GPIO_PIN_6 | LL_GPIO_PIN_7,
            .Mode       = LL_GPIO_MODE_ALTERNATE,
            .Speed      = LL_GPIO_SPEED_FREQ_VERY_HIGH,
            .OutputType = LL_GPIO_OUTPUT_PUSHPULL,
            .Pull       = LL_GPIO_PULL_NO,
            .Alternate  = LL_GPIO_AF_5,
        };

        LL_GPIO_Init( GPIOA, &GPIO_InitStruct );
    }
    else if( spi_cfg_slot->spi == SPI2 )
    {
        /* Peripheral clock enable */
        LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_SPI2 );
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOB );

        /** SPI2 GPIO Configuration
        PB13   ------> SPI2_SCK
        PB14   ------> SPI2_MISO
        PB15   ------> SPI2_MOSI
        */
        LL_GPIO_InitTypeDef GPIO_InitStruct = {
            .Pin        = LL_GPIO_PIN_13 | LL_GPIO_PIN_14 | LL_GPIO_PIN_15,
            .Mode       = LL_GPIO_MODE_ALTERNATE,
            .Speed      = LL_GPIO_SPEED_FREQ_VERY_HIGH,
            .OutputType = LL_GPIO_OUTPUT_PUSHPULL,
            .Pull       = LL_GPIO_PULL_NO,
            .Alternate  = LL_GPIO_AF_5,
        };

        LL_GPIO_Init( GPIOB, &GPIO_InitStruct );
    }
    else if( spi_cfg_slot->spi == SPI3 )
    {
        /* Peripheral clock enable */
        LL_APB1_GRP1_EnableClock( LL_APB1_GRP1_PERIPH_SPI3 );
        LL_AHB2_GRP1_EnableClock( LL_AHB2_GRP1_PERIPH_GPIOC );

        /** SPI3 GPIO Configuration
        PC10   ------> SPI3_SCK
        PC11   ------> SPI3_MISO
        PC12   ------> SPI3_MOSI
        */
        LL_GPIO_InitTypeDef GPIO_InitStruct = {
            .Pin        = LL_GPIO_PIN_10 | LL_GPIO_PIN_11 | LL_GPIO_PIN_12,
            .Mode       = LL_GPIO_MODE_ALTERNATE,
            .Speed      = LL_GPIO_SPEED_FREQ_VERY_HIGH,
            .OutputType = LL_GPIO_OUTPUT_PUSHPULL,
            .Pull       = LL_GPIO_PULL_NO,
            .Alternate  = LL_GPIO_AF_6,
        };

        LL_GPIO_Init( GPIOC, &GPIO_InitStruct );
    }
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    LL_SPI_InitTypeDef SPI_InitStruct = {
        .BaudRate          = LL_SPI_BAUDRATEPRESCALER_DIV16,
        .TransferDirection = LL_SPI_FULL_DUPLEX,
        .Mode              = ( cfg_app->is_master ) ? LL_SPI_MODE_MASTER : LL_SPI_MODE_SLAVE,
        .DataWidth         = LL_SPI_DATAWIDTH_8BIT,
        .ClockPolarity     = LL_SPI_POLARITY_LOW,
        .ClockPhase        = LL_SPI_PHASE_1EDGE,
        .NSS               = LL_SPI_NSS_SOFT,
        .BitOrder          = LL_SPI_MSB_FIRST,
        .CRCCalculation    = LL_SPI_CRCCALCULATION_DISABLE,
        .CRCPoly           = 7,
    };

    if( LL_SPI_Init( spi_cfg_slot->spi, &SPI_InitStruct ) != SUCCESS )
    {
        return SMTC_HAL_MCU_STATUS_ERROR;
    }

    LL_SPI_SetRxFIFOThreshold( spi_cfg_slot->spi, LL_SPI_RX_FIFO_TH_QUARTER );
    LL_SPI_SetStandard( spi_cfg_slot->spi, LL_SPI_PROTOCOL_MOTOROLA );
    LL_SPI_DisableNSSPulseMgt( spi_cfg_slot->spi );

    LL_SPI_Enable( spi_cfg_slot->spi );
    while( LL_SPI_IsEnabled( spi_cfg_slot->spi ) == 0 );

    spi_cfg_slot->is_cfged           = true;
    spi_cfg_slot->dma_periph_mapping = 0;

    *inst = spi_cfg_slot;

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_spi_dma_init( const smtc_hal_mcu_spi_dma_cfg_t      cfg,
                                                 const smtc_hal_mcu_spi_dma_cfg_app_t* cfg_app,
                                                 smtc_hal_mcu_spi_inst_t*              inst )
{
    const smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t* dma_periph_configuration =
        smtc_hal_mcu_spi_stm32l4_get_dma_peripheral_configuration( cfg->spi );
    if( dma_periph_configuration != 0 )
    {
        smtc_hal_mcu_status_t   status;
        smtc_hal_mcu_spi_inst_t spi_cfg_slot = NULL;

        /* Setting up SPI for DMA usage */
        struct smtc_hal_mcu_spi_cfg_s cfg_spi = {
            .spi = dma_periph_configuration->spi,
        };
        const struct smtc_hal_mcu_spi_cfg_app_s cfg_spi_app = {
            .is_master = cfg_app->is_master,
        };

        if( SMTC_HAL_MCU_STATUS_OK != ( status = smtc_hal_mcu_spi_init( &cfg_spi, &cfg_spi_app, &spi_cfg_slot ) ) )
        {
            return status;
        }

        /* Update Callbacks for DMA */
        spi_cfg_slot->DMAcallback_tx       = cfg_app->callback_tx;
        spi_cfg_slot->DMAcallback_rx       = cfg_app->callback_rx;
        spi_cfg_slot->DMAcallback_tx_error = cfg_app->callback_error_tx;
        spi_cfg_slot->DMAcallback_rx_error = cfg_app->callback_error_rx;
        spi_cfg_slot->dma_periph_mapping   = dma_periph_configuration;

        LL_AHB1_GRP1_EnableClock( dma_periph_configuration->ahb_bus );

        NVIC_SetPriority( dma_periph_configuration->dma_channel_irq_rx, 0 );
        NVIC_EnableIRQ( dma_periph_configuration->dma_channel_irq_rx );
        NVIC_SetPriority( dma_periph_configuration->dma_channel_irq_tx, 0 );
        NVIC_EnableIRQ( dma_periph_configuration->dma_channel_irq_tx );

        LL_DMA_EnableIT_TC( dma_periph_configuration->dma, dma_periph_configuration->dma_channel_rx );
        LL_DMA_EnableIT_TE( dma_periph_configuration->dma, dma_periph_configuration->dma_channel_rx );
        LL_DMA_EnableIT_TC( dma_periph_configuration->dma, dma_periph_configuration->dma_channel_tx );
        LL_DMA_EnableIT_TE( dma_periph_configuration->dma, dma_periph_configuration->dma_channel_tx );

