Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_spi_stm32l4.c
        *inst = spi_cfg_slot;
        return SMTC_HAL_MCU_STATUS_OK;
    }
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }
}

smtc_hal_mcu_status_t smtc_hal_mcu_spi_deinit( smtc_hal_mcu_spi_inst_t* inst )
{
    smtc_hal_mcu_spi_inst_t inst_local = *inst;

    if( smtc_hal_mcu_spi_stm32l4_is_real_inst( inst_local ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    if( inst_local->is_cfged == false )
    {
        return SMTC_HAL_MCU_STATUS_NOT_INIT;
    }

    if( inst_local->spi == SPI1 )
    {
        if( LL_SPI_DeInit( inst_local->spi ) != SUCCESS )
        {
            return SMTC_HAL_MCU_STATUS_ERROR;
        }

        LL_GPIO_InitTypeDef GPIO_InitStruct = {
            .Pin        = LL_GPIO_PIN_5 | LL_GPIO_PIN_6 | LL_GPIO_PIN_7,
            .Mode       = LL_GPIO_MODE_ANALOG,
            .Speed      = LL_GPIO_SPEED_FREQ_LOW,
            .OutputType = LL_GPIO_OUTPUT_OPENDRAIN,
            .Pull       = LL_GPIO_PULL_NO,
            .Alternate  = LL_GPIO_AF_0,
        };

        if( LL_GPIO_Init( GPIOA, &GPIO_InitStruct ) != SUCCESS )
        {
            return SMTC_HAL_MCU_STATUS_ERROR;
        }
    }
    else if( inst_local->spi == SPI3 )
    {
        if( LL_SPI_DeInit( inst_local->spi ) != SUCCESS )
        {
            return SMTC_HAL_MCU_STATUS_ERROR;
        }

        LL_GPIO_InitTypeDef GPIO_InitStruct = {
            .Pin        = LL_GPIO_PIN_10 | LL_GPIO_PIN_11 | LL_GPIO_PIN_12,
            .Mode       = LL_GPIO_MODE_ANALOG,
            .Speed      = LL_GPIO_SPEED_FREQ_LOW,
            .OutputType = LL_GPIO_OUTPUT_OPENDRAIN,
            .Pull       = LL_GPIO_PULL_NO,
            .Alternate  = LL_GPIO_AF_0,
        };

        if( LL_GPIO_Init( GPIOC, &GPIO_InitStruct ) != SUCCESS )
        {
            return SMTC_HAL_MCU_STATUS_ERROR;
        }
    }
    else
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    inst_local->is_cfged = false;

    *inst = NULL;

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_spi_rw_buffer( smtc_hal_mcu_spi_inst_t inst, const uint8_t* data_out,
                                                  uint8_t* data_in, uint16_t data_length )
{
    uint16_t rem_bytes_to_send    = data_length;
    uint16_t rem_bytes_to_receive = data_length;

    if( smtc_hal_mcu_spi_stm32l4_is_real_inst( inst ) == false )
    {
        return SMTC_HAL_MCU_STATUS_BAD_PARAMETERS;
    }

    if( inst->is_cfged == false )
    {
        return SMTC_HAL_MCU_STATUS_NOT_INIT;
    }

    if( data_length > 1 )
    {
        LL_SPI_SetRxFIFOThreshold( inst->spi, LL_SPI_RX_FIFO_TH_HALF );
    }
    else
    {
        LL_SPI_SetRxFIFOThreshold( inst->spi, LL_SPI_RX_FIFO_TH_QUARTER );
    }

    while( ( rem_bytes_to_send > 0 ) || ( rem_bytes_to_receive > 0 ) )
    {
        if( ( LL_SPI_IsActiveFlag_TXE( inst->spi ) == 1 ) && ( rem_bytes_to_send > 0 ) )
        {
            if( rem_bytes_to_send > 1 )  // Load a 2-byte long chunk in the TXFIFO
            {
                const uint16_t bytes_to_transmit = ( data_out == NULL )
                                                       ? 0x0000
                                                       : ( data_out[data_length - rem_bytes_to_send + 1] << 8 ) +
                                                             data_out[data_length - rem_bytes_to_send];
                LL_SPI_TransmitData16( inst->spi, bytes_to_transmit );
                rem_bytes_to_send -= 2;
            }
            else  // Load a 1-byte long chunk in the TXFIFO
            {
                const uint8_t byte_to_transmit =
                    ( data_out == NULL ) ? 0x00 : data_out[data_length - rem_bytes_to_send];
                LL_SPI_TransmitData8( inst->spi, byte_to_transmit );
                rem_bytes_to_send -= 1;
            }
        }

        if( ( LL_SPI_IsActiveFlag_RXNE( inst->spi ) == 1 ) && ( rem_bytes_to_receive > 0 ) )
        {
            if( rem_bytes_to_receive > 1 )
            {
                const uint16_t bytes_received = LL_SPI_ReceiveData16( inst->spi );

                if( data_in != NULL )
                {
                    data_in[data_length - rem_bytes_to_receive + 1] = ( uint8_t ) ( bytes_received >> 8 );
                    data_in[data_length - rem_bytes_to_receive]     = ( uint8_t ) ( bytes_received >> 0 );
                }

                rem_bytes_to_receive -= 2;

                if( rem_bytes_to_receive == 1 )
                {
                    LL_SPI_SetRxFIFOThreshold( inst->spi, LL_SPI_RX_FIFO_TH_QUARTER );
                }
            }
            else
            {
                const uint8_t byte_received = LL_SPI_ReceiveData8( inst->spi );

                if( data_in != NULL )
                {
                    data_in[data_length - rem_bytes_to_receive] = byte_received;
                }

                rem_bytes_to_receive -= 1;
            }
        }
    }

    return SMTC_HAL_MCU_STATUS_OK;
}

smtc_hal_mcu_status_t smtc_hal_mcu_spi_dma_send_receive( smtc_hal_mcu_spi_inst_t spi, const uint8_t* data_out,
                                                         uint8_t* data_in, unsigned int length )
{
    if( data_out == NULL )
    {
        // Only send null value
        LL_DMA_ConfigTransfer( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx,
                               LL_DMA_DIRECTION_MEMORY_TO_PERIPH | LL_DMA_PRIORITY_HIGH | LL_DMA_MODE_NORMAL |
                                   LL_DMA_PERIPH_NOINCREMENT | LL_DMA_MEMORY_NOINCREMENT | LL_DMA_PDATAALIGN_BYTE |
                                   LL_DMA_MDATAALIGN_BYTE );
        LL_DMA_ConfigAddresses(
            spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx, ( uint32_t ) &dma_null_value,
            LL_SPI_DMA_GetRegAddr( spi->spi ),
            LL_DMA_GetDataTransferDirection( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx ) );
    }
    else
    {
        LL_DMA_ConfigTransfer( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx,
                               LL_DMA_DIRECTION_MEMORY_TO_PERIPH | LL_DMA_PRIORITY_HIGH | LL_DMA_MODE_NORMAL |
                                   LL_DMA_PERIPH_NOINCREMENT | LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
                                   LL_DMA_MDATAALIGN_BYTE );
        LL_DMA_ConfigAddresses(
            spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx, ( uint32_t ) data_out,
            LL_SPI_DMA_GetRegAddr( spi->spi ),
            LL_DMA_GetDataTransferDirection( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx ) );
    }

    if( data_in == NULL )
    {
        // Received data shall be disregarded
        LL_DMA_ConfigTransfer( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx,
                               LL_DMA_DIRECTION_PERIPH_TO_MEMORY | LL_DMA_PRIORITY_HIGH | LL_DMA_MODE_NORMAL |
                                   LL_DMA_PERIPH_NOINCREMENT | LL_DMA_MEMORY_NOINCREMENT | LL_DMA_PDATAALIGN_BYTE |
                                   LL_DMA_MDATAALIGN_BYTE );
        LL_DMA_ConfigAddresses(
            spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx, LL_SPI_DMA_GetRegAddr( spi->spi ),
            ( uint32_t ) &garbage_value,
            LL_DMA_GetDataTransferDirection( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx ) );
    }
    else
    {
        LL_DMA_ConfigTransfer( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx,
                               LL_DMA_DIRECTION_PERIPH_TO_MEMORY | LL_DMA_PRIORITY_HIGH | LL_DMA_MODE_NORMAL |
                                   LL_DMA_PERIPH_NOINCREMENT | LL_DMA_MEMORY_INCREMENT | LL_DMA_PDATAALIGN_BYTE |
                                   LL_DMA_MDATAALIGN_BYTE );
        LL_DMA_ConfigAddresses(
            spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx, LL_SPI_DMA_GetRegAddr( spi->spi ),
            ( uint32_t ) data_in,
            LL_DMA_GetDataTransferDirection( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx ) );
    }
    LL_DMA_SetDataLength( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx, length );
    LL_DMA_SetDataLength( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx, length );
    LL_DMA_SetPeriphRequest( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx,
                             spi->dma_periph_mapping->periph_request );
    LL_DMA_SetPeriphRequest( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx,
                             spi->dma_periph_mapping->periph_request );

    /* Configure SPI1 DMA transfer interrupts */
    /* Enable DMA RX Interrupt */
    LL_SPI_EnableDMAReq_RX( spi->spi );
    /* Enable DMA TX Interrupt */
    LL_SPI_EnableDMAReq_TX( spi->spi );
    /* Enable DMA Channel Tx */
    LL_DMA_EnableChannel( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_rx );
    LL_DMA_EnableChannel( spi->dma_periph_mapping->dma, spi->dma_periph_mapping->dma_channel_tx );
    return SMTC_HAL_MCU_STATUS_OK;
}

