Lora-net/SWSD003/libs/smtc-hal-mcu-stm32l4/src/smtc_hal_mcu_spi_stm32l4.c
/*
 * -----------------------------------------------------------------------------
 * --- PRIVATE FUNCTIONS DEFINITION --------------------------------------------
 */

const smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t* smtc_hal_mcu_spi_stm32l4_get_dma_peripheral_configuration(
    SPI_TypeDef* spi )
{
    for( uint32_t index = 0; index < sizeof( dma_periph_mappping ); index++ )
    {
        const smtc_hal_mcu_spi_stm32l4_dma_periph_mapping_t* local_config = &dma_periph_mappping[index];
        if( local_config->spi == spi )
        {
            return local_config;
        }
    }
    return 0;
}

static struct smtc_hal_mcu_spi_inst_s* smtc_hal_mcu_spi_stm32l4_get_free_slot( void )
{
    for( int i = 0; i < SMTC_HAL_MCU_SPI_STM32L4_N_INSTANCES_MAX; i++ )
    {
        if( spi_inst_array[i].is_cfged == false )
        {
            return &spi_inst_array[i];
        }
    }

    return NULL;
}

static bool smtc_hal_mcu_spi_stm32l4_is_real_inst( smtc_hal_mcu_spi_inst_t inst )
{
    for( int i = 0; i < SMTC_HAL_MCU_SPI_STM32L4_N_INSTANCES_MAX; i++ )
    {
        if( inst == &spi_inst_array[i] )
        {
            return true;
        }
    }

    return false;
}

#define CASE_IS_ACTIVE_FLAG_CHANNEL( ll_dma_name, channel_no, dma ) \
    case LL_DMA_CHANNEL_##channel_no:                               \
    {                                                               \
        return LL_DMA_##ll_dma_name##channel_no( dma );             \
        break;                                                      \
    }

uint32_t smtc_hal_mcu_spi_stm32l4_is_active_flag_tc( uint32_t channel, DMA_TypeDef* dma )
{
    switch( channel )
    {
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TC, 1, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TC, 2, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TC, 3, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TC, 4, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TC, 5, dma )
    }

    return 0;
}

void smtc_hal_mcu_spi_stm32l4_clear_flag_gi( uint32_t channel, DMA_TypeDef* dma )
{
    switch( channel )
    {
        CASE_IS_ACTIVE_FLAG_CHANNEL( ClearFlag_GI, 1, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( ClearFlag_GI, 2, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( ClearFlag_GI, 3, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( ClearFlag_GI, 4, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( ClearFlag_GI, 5, dma )
    default:
        break;
    }
}

uint32_t smtc_hal_mcu_spi_stm32l4_is_active_flag_te( uint32_t channel, DMA_TypeDef* dma )
{
    switch( channel )
    {
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TE, 1, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TE, 2, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TE, 3, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TE, 4, dma )
        CASE_IS_ACTIVE_FLAG_CHANNEL( IsActiveFlag_TE, 5, dma )
    }

    return 0;
}

void smtc_hal_mcu_spi_stm32l4_call_dma_callback_irq( DMA_TypeDef* dma, uint32_t channel )
{
    // Search for the spi instance that has interruption registered on this DMA and this channel
    for( int i = 0; i < SMTC_HAL_MCU_SPI_STM32L4_N_INSTANCES_MAX; i++ )
    {
        smtc_hal_mcu_spi_inst_t local_instance = &spi_inst_array[i];
        // Check it is enabled, and with DMA
        if( local_instance->is_cfged == true && local_instance->dma_periph_mapping != 0 )
        {
            // Check it is on this DMA peripheral
            if( local_instance->dma_periph_mapping->dma == dma )
            {
                // Check the DMA channel transmit complete flag is active
                if( smtc_hal_mcu_spi_stm32l4_is_active_flag_tc( channel, dma ) )
                {
                    // Clear the global interrupt flag
                    smtc_hal_mcu_spi_stm32l4_clear_flag_gi( channel, dma );

                    // Check for RX DMA channel
                    if( local_instance->dma_periph_mapping->dma_channel_rx == channel )
                    {
                        // If RX callback is set, call it
                        if( spi_inst_array[i].DMAcallback_rx != NULL )
                        {
                            spi_inst_array[i].DMAcallback_rx( );
                        }
                        break;
                    }
                    // Check for TX DMA channel
                    if( local_instance->dma_periph_mapping->dma_channel_tx == channel )
                    {
                        // If TX callback is set, call it
                        if( spi_inst_array[i].DMAcallback_tx != NULL )
                        {
                            spi_inst_array[i].DMAcallback_tx( );
                        }
                        break;
                    }
                }
            }

            // Check the transmit error flag is active
            if( smtc_hal_mcu_spi_stm32l4_is_active_flag_te( channel, dma ) )
            {
                // Check for RX DMA channel
                if( local_instance->dma_periph_mapping->dma_channel_rx == channel )
                {
                    // If RX error callback is set, call it
                    if( spi_inst_array[i].DMAcallback_rx_error != NULL )
                    {
                        spi_inst_array[i].DMAcallback_rx_error( );
                    }
                    break;
                }
                // Check for TX DMA channel
                if( local_instance->dma_periph_mapping->dma_channel_tx == channel )
                {
                    // If TX error callback is set, call it
                    if( spi_inst_array[i].DMAcallback_tx_error != NULL )
                    {
                        spi_inst_array[i].DMAcallback_tx_error( );
                    }
                    break;
                }
            }
        }
    }
}

#define DEFINE_DMA_CHANNEL_IRQ_HANDLER( dma, channel_no )                                   \
    void dma##_Channel##channel_no##_IRQHandler( void )                                     \
    {                                                                                       \
        smtc_hal_mcu_spi_stm32l4_call_dma_callback_irq( dma, LL_DMA_CHANNEL_##channel_no ); \
    }
DEFINE_DMA_CHANNEL_IRQ_HANDLER( DMA1, 2 )
DEFINE_DMA_CHANNEL_IRQ_HANDLER( DMA1, 3 )
DEFINE_DMA_CHANNEL_IRQ_HANDLER( DMA1, 4 )
DEFINE_DMA_CHANNEL_IRQ_HANDLER( DMA1, 5 )
DEFINE_DMA_CHANNEL_IRQ_HANDLER( DMA2, 1 )
DEFINE_DMA_CHANNEL_IRQ_HANDLER( DMA2, 2 )

/* --- EOF ------------------------------------------------------------------ */
